module reg_file
(
  input  wire        CLK,        // [CLK] 时钟输入（注意：内部写逻辑采用下降沿触发）
  input  wire        WE3,        // [WE3] 寄存器写使能信号

  input  wire [4:0]  A1,         // [A1] 读端口1地址 (rs1, 对应 inst[19:15])
  input  wire [4:0]  A2,         // [A2] 读端口2地址 (rs2, 对应 inst[24:20])
  input  wire [4:0]  A3,         // [A3] 写端口地址 (rd)
  input  wire [31:0] WD3,        // [WD3] 准备写入寄存器堆的数据

  output wire [31:0] RD1,        // [RD1] 读端口1输出数据
  output wire [31:0] RD2         // [RD2] 读端口2输出数据
);

  // 声明 32个 32-bit 通用寄存器阵列 (x0 到 x31)
  reg [31:0] rf [0:31];

  // =========================================================================
  // 1. 同步写逻辑：严格对照架构图，在时钟下降沿（negedge）且写使能有效时写入
  // =========================================================================
  always @(negedge CLK) begin
    if (WE3 && (A3!= 5'b0)) begin
        rf[A3] <= WD3; // 正常写入目标寄存器
    end
  end

  // =========================================================================
  // 2. 异步读逻辑：纯组合逻辑，地址改变，数据立刻输出
  //    注意：RISC-V 规定 x0 寄存器必须恒等于 0
  // =========================================================================
  assign RD1 = (A1 == 5'b0) ? 32'b0 : rf[A1];
  assign RD2 = (A2 == 5'b0) ? 32'b0 : rf[A2];

  // =========================================================================
  // 3. 仿真初始化：给寄存器赋初值，方便 Testbench 观察
  // =========================================================================
  integer i;
  initial begin
    for (i = 0; i < 32; i = i + 1) begin
      rf[i] = 32'b0; // 默认全部清零
    end
  end

endmodule